jmeter-tests/load-test/aggregate.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
Check Insurance (External API),23936,1,1,2,3,4,0,138,0.004%,583.23587,276.13,195.92
Get All Patients,6252,19,18,29,32,38,9,149,0.064%,152.33547,138399.36,36.97
Get CSRF Token,2809,0,0,1,1,1,0,8,0.036%,68.69314,39.75,18.10
Get Patient by ID,3477,1,1,2,2,4,0,105,0.000%,85.06006,53.61,19.77
Create Patient,2770,3,3,4,5,8,1,90,0.036%,67.74272,44.35,42.26
Get Bet Patients,40,1299,865,2345,2412,2785,615,2785,5.000%,.97464,2.74,0.25
Create Bet,38,2,2,3,4,5,1,5,0.000%,.97182,0.48,0.50
TOTAL,39322,5,2,14,22,32,0,2785,0.023%,958.04502,138805.72,313.42